challenges.org
#+TITLE: Cryptopals Challenges
#+PROPERTY: header-args :exports both :results value verbatim

* Set 1
** Convert hex to base64
#+BEGIN_SRC lisp
  (cp:bytes->base64 (cp:hex->bytes "49276d206b696c6c696e6720796f757220627261696e206c696b65206120706f69736f6e6f7573206d757368726f6f6d"))
#+END_SRC

#+RESULTS:
: "SSdtIGtpbGxpbmcgeW91ciBicmFpbiBsaWtlIGEgcG9pc29ub3VzIG11c2hyb29t"
** Fixed XOR
#+BEGIN_SRC lisp
  (cp:bytes->hex
   (cp:fixed-xor
    (cp:hex->bytes "1c0111001f010100061a024b53535009181c")
    (cp:hex->bytes "686974207468652062756c6c277320657965")))
#+END_SRC

#+RESULTS:
: "746865206B696420646F6E277420706C6179"
** Single-byte XOR cipher
#+BEGIN_SRC lisp
  (car
   (cp:break-single-byte-xor
    (cp:hex->bytes "1b37373331363f78151b7f2b783431333d78397828372d363c78373e783a393b3736")))
#+END_SRC

#+RESULTS:
: (:SCORE 44.4112472277668d0 :KEY 88 :STRING "Cooking MC's like a pound of bacon")
To score English text, I used a Chi-squared test. I had to play with the
frequencies a fair amount -- just using a-z was not giving great results. The
most important thing I did was to add a penalty for uncommon characters. Common
punctuation is ignored, but uncommon punctuation is penalized (see the ~#\Nul~
frequency below).
#+BEGIN_SRC lisp
  cp:*frequencies*
#+END_SRC

#+RESULTS:
: ((#\a . 0.0651738d0) (#\b . 0.0124248d0) (#\c . 0.0217339d0)
:  (#\d . 0.0349835d0) (#\e . 0.1041442d0) (#\f . 0.0197881d0) (#\g . 0.015861d0)
:  (#\h . 0.0492888d0) (#\i . 0.0558094d0) (#\j . 9.033d-4) (#\k . 0.0050529d0)
:  (#\l . 0.033149d0) (#\m . 0.0202124d0) (#\n . 0.0564513d0) (#\o . 0.0596302d0)
:  (#\p . 0.0137645d0) (#\q . 8.606d-4) (#\r . 0.0497563d0) (#\s . 0.051576d0)
:  (#\t . 0.0729357d0) (#\u . 0.0225134d0) (#\v . 0.0082903d0)
:  (#\w . 0.0171272d0) (#\x . 0.0013692d0) (#\y . 0.0145984d0) (#\z . 7.836d-4)
:  (#\  . 0.1918182d0) (#\Nul . 0.001d0))

** Detect single-character XOR
#+BEGIN_SRC lisp
  (flet ((top-score (hex)
           (first (cp:break-single-byte-xor (cp:hex->bytes hex)))))
    (let ((scores (with-open-file (in "4.txt")
                    (loop for l = (read-line in nil)
                          while l collect (nconc (list :line l)
                                                 (top-score l))))))
      (car (sort scores #'< :key (lambda (x) (getf x :score))))))
#+END_SRC

#+RESULTS:
: (:LINE "7b5a4215415d544115415d5015455447414c155c46155f4058455c5b523f" :SCORE
:  51.34496174418811d0 :KEY 53 :STRING "Now that the party is jumping
: ")
** Implement repeating-key XOR
#+BEGIN_SRC lisp
  (cp:bytes->hex
   (cp:repeating-xor (cp:ascii->bytes "ICE")
                     (cp:ascii->bytes "Burning 'em, if you ain't quick and nimble
  I go crazy when I hear a cymbal")))
#+END_SRC

#+RESULTS:
: "0B3637272A2B2E63622C2E69692A23693A2A3C6324202D623D63343C2A26226324272765272A282B2F20430A652E2C652A3124333A653E2B2027630C692B20283165286326302E27282F"
