docs/challenges.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-08 Sun 21:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cryptopals Challenges</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Cryptopals Challenges</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge6dfbaa">1. Set 1</a>
<ul>
<li><a href="#org77784a9">1.1. Convert hex to base64</a></li>
<li><a href="#org04a5a9f">1.2. Fixed XOR</a></li>
<li><a href="#orgd99da0c">1.3. Single-byte XOR cipher</a></li>
<li><a href="#org3297eeb">1.4. Detect single-character XOR</a></li>
<li><a href="#orgff0c82f">1.5. Implement repeating-key XOR</a></li>
<li><a href="#org7a6c18a">1.6. Break repeating-key XOR</a></li>
<li><a href="#org4788a75">1.7. AES in ECB mode</a></li>
<li><a href="#orge4652ee">1.8. Detect AES in ECB mode</a></li>
</ul>
</li>
<li><a href="#orgc619bbd">2. Set 2</a>
<ul>
<li><a href="#org6e3007a">2.1. Implement PKCS#7 padding</a></li>
<li><a href="#orge136f59">2.2. Implement CBC mode</a></li>
<li><a href="#org431d7ec">2.3. An ECB/CBC detection oracle</a></li>
<li><a href="#org1bac13e">2.4. Byte-at-a-time ECB decryption (Simple)</a>
<ul>
<li><a href="#org09e8149">2.4.1. Detect the block size</a></li>
<li><a href="#org0691999">2.4.2. Detect that the function is using ECB</a></li>
<li><a href="#orgfb5e8fa">2.4.3. Use oracle to break ECB</a></li>
</ul>
</li>
<li><a href="#org172a72c">2.5. ECB cut-and-paste</a>
<ul>
<li><a href="#orgdf41f19">2.5.1. Write a k=v parsing routine</a></li>
<li><a href="#orgbdcaa7d">2.5.2. Write a function that encodes a user profile</a></li>
<li><a href="#org1e2aab1">2.5.3. Carry out a cut-paste attack</a></li>
</ul>
</li>
<li><a href="#orgfc75e3c">2.6. Byte-at-a-time ECB decryption (Harder)</a></li>
<li><a href="#orgc8381b7">2.7. PKCS#7 padding validation</a></li>
<li><a href="#org1abe578">2.8. CBC bitflipping attacks</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge6dfbaa" class="outline-2">
<h2 id="orge6dfbaa"><span class="section-number-2">1</span> Set 1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org77784a9" class="outline-3">
<h3 id="org77784a9"><span class="section-number-3">1.1</span> Convert hex to base64</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:bytes-&gt;base64 <span style="color: #6c3163;">(</span>cp:hex-&gt;bytes <span style="color: #2d9574;">"49276d206b696c6c696e6720796f757220627261696e206c696b65206120706f69736f6e6f7573206d757368726f6f6d"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"SSdtIGtpbGxpbmcgeW91ciBicmFpbiBsaWtlIGEgcG9pc29ub3VzIG11c2hyb29t"

</pre>
</div>
</div>
<div id="outline-container-org04a5a9f" class="outline-3">
<h3 id="org04a5a9f"><span class="section-number-3">1.2</span> Fixed XOR</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:bytes-&gt;hex
 <span style="color: #6c3163;">(</span>cp:fixed-xor
  <span style="color: #2d9574;">(</span>cp:hex-&gt;bytes <span style="color: #2d9574;">"1c0111001f010100061a024b53535009181c"</span><span style="color: #2d9574;">)</span>
  <span style="color: #2d9574;">(</span>cp:hex-&gt;bytes <span style="color: #2d9574;">"686974207468652062756c6c277320657965"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"746865206B696420646F6E277420706C6179"

</pre>
</div>
</div>
<div id="outline-container-orgd99da0c" class="outline-3">
<h3 id="orgd99da0c"><span class="section-number-3">1.3</span> Single-byte XOR cipher</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>car
 <span style="color: #6c3163;">(</span>cp:break-single-byte-xor
  <span style="color: #2d9574;">(</span>cp:hex-&gt;bytes <span style="color: #2d9574;">"1b37373331363f78151b7f2b783431333d78397828372d363c78373e783a393b3736"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
(:SCORE 44.4112472277668d0 :KEY 88 :STRING "Cooking MC's like a pound of bacon")

</pre>
<p>
To score English text, I used a Chi-squared test. I had to play with the
frequencies a fair amount &#x2013; just using a-z was not giving great results. The
most important thing I did was to add a penalty for uncommon characters. Common
punctuation is ignored, but uncommon punctuation is penalized (see the <code>#\Nul</code>
frequency below).
</p>
<div class="org-src-container">
<pre class="src src-lisp">cp:*frequencies*
</pre>
</div>

<pre class="example">
((#\a . 0.0651738d0) (#\b . 0.0124248d0) (#\c . 0.0217339d0)
 (#\d . 0.0349835d0) (#\e . 0.1041442d0) (#\f . 0.0197881d0) (#\g . 0.015861d0)
 (#\h . 0.0492888d0) (#\i . 0.0558094d0) (#\j . 9.033d-4) (#\k . 0.0050529d0)
 (#\l . 0.033149d0) (#\m . 0.0202124d0) (#\n . 0.0564513d0) (#\o . 0.0596302d0)
 (#\p . 0.0137645d0) (#\q . 8.606d-4) (#\r . 0.0497563d0) (#\s . 0.051576d0)
 (#\t . 0.0729357d0) (#\u . 0.0225134d0) (#\v . 0.0082903d0)
 (#\w . 0.0171272d0) (#\x . 0.0013692d0) (#\y . 0.0145984d0) (#\z . 7.836d-4)
 (#\  . 0.1918182d0) (#\Nul . 0.001d0))

</pre>
</div>
</div>

<div id="outline-container-org3297eeb" class="outline-3">
<h3 id="org3297eeb"><span class="section-number-3">1.4</span> Detect single-character XOR</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">flet</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>top-score <span style="color: #67b11d;">(</span>hex<span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>first <span style="color: #b1951d;">(</span>cp:break-single-byte-xor <span style="color: #3a81c3;">(</span>cp:hex-&gt;bytes hex<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>scores <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">with-open-file</span> <span style="color: #3a81c3;">(</span>in <span style="color: #2d9574;">"4.txt"</span><span style="color: #3a81c3;">)</span>
                  <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">loop</span> for l = <span style="color: #6c3163;">(</span>read-line in nil<span style="color: #6c3163;">)</span>
                        while l collect <span style="color: #6c3163;">(</span>nconc <span style="color: #2d9574;">(</span>list <span style="color: #3a81c3;">:line</span> l<span style="color: #2d9574;">)</span>
                                               <span style="color: #2d9574;">(</span>top-score l<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>car <span style="color: #67b11d;">(</span>sort scores #'&lt; <span style="color: #3a81c3;">:key</span> <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>getf x <span style="color: #3a81c3;">:score</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
(:LINE "7b5a4215415d544115415d5015455447414c155c46155f4058455c5b523f" :SCORE
 51.34496174418811d0 :KEY 53 :STRING "Now that the party is jumping
")

</pre>
</div>
</div>
<div id="outline-container-orgff0c82f" class="outline-3">
<h3 id="orgff0c82f"><span class="section-number-3">1.5</span> Implement repeating-key XOR</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:bytes-&gt;hex
 <span style="color: #6c3163;">(</span>cp:repeating-xor <span style="color: #2d9574;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"ICE"</span><span style="color: #2d9574;">)</span>
                   <span style="color: #2d9574;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"Burning 'em, if you ain't quick and nimble</span>
<span style="color: #2d9574;">I go crazy when I hear a cymbal"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"0B3637272A2B2E63622C2E69692A23693A2A3C6324202D623D63343C2A26226324272765272A282B2F20430A652E2C652A3124333A653E2B2027630C692B20283165286326302E27282F"

</pre>
</div>
</div>
