challenges.org
** Detect AES in ECB mode
To detect collisions, ~DETECT-AES-128-ECB~ breaks each line up into blocks
and compares each block against the others, looking for blocks that are equal.
It returns the number of equal blocks if ECB is detected, or ~NIL~
otherwise.
#+BEGIN_SRC lisp
  (let ((lines (cp:read-hex-line-file "8.txt")))
    (remove-if #'null (mapcar (lambda (line)
                                (cons (cp:detect-aes-128-ecb line)
                                      (cp:bytes->hex line)))
                              lines)
               :key #'car))
#+END_SRC

#+RESULTS:
: ((6
:   . "D880619740A8A19B7840A8A31C810A3D08649AF70DC06F4FD5D2D69C744CD283E2DD052F6B641DBF9D11B0348542BB5708649AF70DC06F4FD5D2D69C744CD2839475C9DFDBC1D46597949D9C7E82BF5A08649AF70DC06F4FD5D2D69C744CD28397A93EAB8D6AECD566489154789A6B0308649AF70DC06F4FD5D2D69C744CD283D403180C98C8F6DB1F2A3F9C4040DEB0AB51B29933F2C123C58386B06FBA186A"))
* Set 2
** Implement PKCS#7 padding
#+BEGIN_SRC lisp
  (cp:pad-pkcs7 (cp:ascii->bytes "YELLOW SUBMARINE") :block-size 20)
#+END_SRC

#+RESULTS:
: #(89 69 76 76 79 87 32 83 85 66 77 65 82 73 78 69 4 4 4 4)
** Implement CBC mode
#+BEGIN_SRC lisp
  (cp:bytes->ascii
   (cp:unpad-pkcs7
    (cp:decrypt-aes-128-cbc
     (cp:ascii->bytes "YELLOW SUBMARINE")
     (make-array 16 :initial-element 0)
     (cp:read-base64-file "10.txt"))))
#+END_SRC

#+RESULTS:
#+begin_example
"I'm back and I'm ringin' the bell
A rockin' on the mike while the fly girls yell
In ecstasy in the back of me
Well that's my DJ Deshay cuttin' all them Z's
Hittin' hard and the girlies goin' crazy
Vanilla's on the mike, man I'm not lazy.

I'm lettin' my drug kick in
It controls my mouth and I begin
To just let it flow, let my concepts go
My posse's to the side yellin', Go Vanilla Go!

Smooth 'cause that's the way I will be
And if you don't give a damn, then
Why you starin' at me
So get off 'cause I control the stage
There's no dissin' allowed
I'm in my own phase
The girlies sa y they love me and that is ok
And I can dance better than any kid n' play

Stage 2 -- Yea the one ya' wanna listen to
It's off my head so let the beat play through
So I can funk it up and make it sound good
1-2-3 Yo -- Knock on some wood
For good luck, I like my rhymes atrocious
Supercalafragilisticexpialidocious
I'm an effect and that you can bet
I can take a fly girl and make her wet.

I'm like Samson -- Samson to Delilah
There's no denyin', You can try to hang
But you'll keep tryin' to get my style
Over and over, practice makes perfect
But not if you're a loafer.

You'll get nowhere, no place, no time, no girls
Soon -- Oh my God, homebody, you probably eat
Spaghetti with a spoon! Come on and say it!

VIP. Vanilla Ice yep, yep, I'm comin' hard like a rhino
Intoxicating so you stagger like a wino
So punks stop trying and girl stop cryin'
Vanilla Ice is sellin' and you people are buyin'
'Cause why the freaks are jockin' like Crazy Glue
Movin' and groovin' trying to sing along
All through the ghetto groovin' this here song
Now you're amazed by the VIP posse.

Steppin' so hard like a German Nazi
Startled by the bases hittin' ground
There's no trippin' on mine, I'm just gettin' down
Sparkamatic, I'm hangin' tight like a fanatic
You trapped me once and I thought that
You might have it
So step down and lend me your ear
'89 in my time! You, '90 is my year.

You're weakenin' fast, YO! and I can tell it
Your body's gettin' hot, so, so I can smell it
So don't be mad and don't be sad
'Cause the lyrics belong to ICE, You can call me Dad
You're pitchin' a fit, so step back and endure
Let the witch doctor, Ice, do the dance to cure
So come up close and don't be square
You wanna battle me -- Anytime, anywhere

You thought that I was weak, Boy, you're dead wrong
So come on, everybody and sing this song

Say -- Play that funky music Say, go white boy, go white boy go
play that funky music Go white boy, go white boy, go
Lay down and boogie and play that funky music till you die.

Play that funky music Come on, Come on, let me hear
Play that funky music white boy you say it, say it
Play that funky music A little louder now
Play that funky music, white boy Come on, Come on, Come on
Play that funky music
"
#+end_example
** An ECB/CBC detection oracle
Run ~ENCRYPTION-ORACLE~ ten times, and collect the results. My oracle
returns multiple values -- the encrypted output, and ~T~ for ECB or
~NIL~ for CBC. Run the ECB detector on the oracle output, and ensure
we correctly detected the ECB encryptions.
#+BEGIN_SRC lisp
  (let* ((input (make-array (* 16 4) :initial-element (char-code #\A)))
         (runs (loop repeat 10
                     collect (multiple-value-list (cp:encryption-oracle input))))
         (results (mapcar (lambda (r) (cons (second r)
                                            (cp:detect-aes-128-ecb (first r))))
                          runs)))
    (values results (every (lambda (r) (or (and (car r) (cdr r))
                                           (not (or (car r) (cdr r)))))
                           results)))
#+END_SRC

#+RESULTS:
: ((NIL) (T . 3) (T . 3) (NIL) (T . 3) (T . 3) (T . 3) (NIL) (NIL) (NIL))
: T
