docs/challenges.html
<div id="outline-container-orge4652ee" class="outline-3">
<h3 id="orge4652ee"><span class="section-number-3">1.8</span> Detect AES in ECB mode</h3>
<div class="outline-text-3" id="text-1-8">
<p>
To detect collisions, <code>DETECT-AES-128-ECB</code> breaks each line up into blocks
and compares each block against the others, looking for blocks that are equal.
It returns the number of equal blocks if ECB is detected, or <code>NIL</code>
otherwise.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>lines <span style="color: #67b11d;">(</span>cp:read-hex-line-file <span style="color: #2d9574;">"8.txt"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>remove-if #'null <span style="color: #2d9574;">(</span>mapcar <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #b1951d;">(</span>line<span style="color: #b1951d;">)</span>
                              <span style="color: #b1951d;">(</span>cons <span style="color: #3a81c3;">(</span>cp:detect-aes-128-ecb line<span style="color: #3a81c3;">)</span>
                                    <span style="color: #3a81c3;">(</span>cp:bytes-&gt;hex line<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
                            lines<span style="color: #2d9574;">)</span>
             <span style="color: #3a81c3;">:key</span> #'car<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
((6
  . "D880619740A8A19B7840A8A31C810A3D08649AF70DC06F4FD5D2D69C744CD283E2DD052F6B641DBF9D11B0348542BB5708649AF70DC06F4FD5D2D69C744CD2839475C9DFDBC1D46597949D9C7E82BF5A08649AF70DC06F4FD5D2D69C744CD28397A93EAB8D6AECD566489154789A6B0308649AF70DC06F4FD5D2D69C744CD283D403180C98C8F6DB1F2A3F9C4040DEB0AB51B29933F2C123C58386B06FBA186A"))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc619bbd" class="outline-2">
<h2 id="orgc619bbd"><span class="section-number-2">2</span> Set 2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6e3007a" class="outline-3">
<h3 id="org6e3007a"><span class="section-number-3">2.1</span> Implement PKCS#7 padding</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:pad-pkcs7 <span style="color: #6c3163;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"YELLOW SUBMARINE"</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">:block-size</span> <span style="color: #4e3163;">20</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
#(89 69 76 76 79 87 32 83 85 66 77 65 82 73 78 69 4 4 4 4)

</pre>
</div>
</div>
<div id="outline-container-orge136f59" class="outline-3">
<h3 id="orge136f59"><span class="section-number-3">2.2</span> Implement CBC mode</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:bytes-&gt;ascii
 <span style="color: #6c3163;">(</span>cp:unpad-pkcs7
  <span style="color: #2d9574;">(</span>cp:decrypt-aes-128-cbc
   <span style="color: #67b11d;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"YELLOW SUBMARINE"</span><span style="color: #67b11d;">)</span>
   <span style="color: #67b11d;">(</span>make-array <span style="color: #4e3163;">16</span> <span style="color: #3a81c3;">:initial-element</span> <span style="color: #4e3163;">0</span><span style="color: #67b11d;">)</span>
   <span style="color: #67b11d;">(</span>cp:read-base64-file <span style="color: #2d9574;">"10.txt"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"I'm back and I'm ringin' the bell
A rockin' on the mike while the fly girls yell
In ecstasy in the back of me
Well that's my DJ Deshay cuttin' all them Z's
Hittin' hard and the girlies goin' crazy
Vanilla's on the mike, man I'm not lazy.

I'm lettin' my drug kick in
It controls my mouth and I begin
To just let it flow, let my concepts go
My posse's to the side yellin', Go Vanilla Go!

Smooth 'cause that's the way I will be
And if you don't give a damn, then
Why you starin' at me
So get off 'cause I control the stage
There's no dissin' allowed
I'm in my own phase
The girlies sa y they love me and that is ok
And I can dance better than any kid n' play

Stage 2 -- Yea the one ya' wanna listen to
It's off my head so let the beat play through
So I can funk it up and make it sound good
1-2-3 Yo -- Knock on some wood
For good luck, I like my rhymes atrocious
Supercalafragilisticexpialidocious
I'm an effect and that you can bet
I can take a fly girl and make her wet.

I'm like Samson -- Samson to Delilah
There's no denyin', You can try to hang
But you'll keep tryin' to get my style
Over and over, practice makes perfect
But not if you're a loafer.

You'll get nowhere, no place, no time, no girls
Soon -- Oh my God, homebody, you probably eat
Spaghetti with a spoon! Come on and say it!

VIP. Vanilla Ice yep, yep, I'm comin' hard like a rhino
Intoxicating so you stagger like a wino
So punks stop trying and girl stop cryin'
Vanilla Ice is sellin' and you people are buyin'
'Cause why the freaks are jockin' like Crazy Glue
Movin' and groovin' trying to sing along
All through the ghetto groovin' this here song
Now you're amazed by the VIP posse.

Steppin' so hard like a German Nazi
Startled by the bases hittin' ground
There's no trippin' on mine, I'm just gettin' down
Sparkamatic, I'm hangin' tight like a fanatic
You trapped me once and I thought that
You might have it
So step down and lend me your ear
'89 in my time! You, '90 is my year.

You're weakenin' fast, YO! and I can tell it
Your body's gettin' hot, so, so I can smell it
So don't be mad and don't be sad
'Cause the lyrics belong to ICE, You can call me Dad
You're pitchin' a fit, so step back and endure
Let the witch doctor, Ice, do the dance to cure
So come up close and don't be square
You wanna battle me -- Anytime, anywhere

You thought that I was weak, Boy, you're dead wrong
So come on, everybody and sing this song

Say -- Play that funky music Say, go white boy, go white boy go
play that funky music Go white boy, go white boy, go
Lay down and boogie and play that funky music till you die.

Play that funky music Come on, Come on, let me hear
Play that funky music white boy you say it, say it
Play that funky music A little louder now
Play that funky music, white boy Come on, Come on, Come on
Play that funky music
"
</pre>
</div>
</div>
<div id="outline-container-org431d7ec" class="outline-3">
<h3 id="org431d7ec"><span class="section-number-3">2.3</span> An ECB/CBC detection oracle</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Run <code>ENCRYPTION-ORACLE</code> ten times, and collect the results. My oracle
returns multiple values &#x2013; the encrypted output, and <code>T</code> for ECB or
<code>NIL</code> for CBC. Run the ECB detector on the oracle output, and ensure
we correctly detected the ECB encryptions.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let*</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>input <span style="color: #67b11d;">(</span>make-array <span style="color: #b1951d;">(</span>* <span style="color: #4e3163;">16</span> <span style="color: #4e3163;">4</span><span style="color: #b1951d;">)</span> <span style="color: #3a81c3;">:initial-element</span> <span style="color: #b1951d;">(</span>char-code #\A<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>runs <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">loop</span> repeat <span style="color: #4e3163;">10</span>
                   collect <span style="color: #b1951d;">(</span>multiple-value-list <span style="color: #3a81c3;">(</span>cp:encryption-oracle input<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>results <span style="color: #67b11d;">(</span>mapcar <span style="color: #b1951d;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #3a81c3;">(</span>r<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>cons <span style="color: #6c3163;">(</span>second r<span style="color: #6c3163;">)</span>
                                          <span style="color: #6c3163;">(</span>cp:detect-aes-128-ecb <span style="color: #2d9574;">(</span>first r<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span>
                        runs<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>values results <span style="color: #2d9574;">(</span>every <span style="color: #67b11d;">(</span><span style="color: #3a81c3; font-weight: bold;">lambda</span> <span style="color: #b1951d;">(</span>r<span style="color: #b1951d;">)</span> <span style="color: #b1951d;">(</span>or <span style="color: #3a81c3;">(</span>and <span style="color: #6c3163;">(</span>car r<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>cdr r<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
                                         <span style="color: #3a81c3;">(</span>not <span style="color: #6c3163;">(</span>or <span style="color: #2d9574;">(</span>car r<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>cdr r<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
                         results<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
((T . 3) (T . 3) (NIL) (NIL) (NIL) (NIL) (T . 3) (T . 3) (NIL) (T . 3))
T

</pre>
</div>
</div>
