challenges.org
** Byte-at-a-time ECB decryption (Simple)
*** Detect the block size
#+BEGIN_SRC lisp
  (cp:with-oracle (oracle)
    (loop for i from 1 to 64
          for encrypted = (oracle (make-array (* i 2) :initial-element 97))
          for blocks = (cp:blockify encrypted :block-size i)
          until (equalp (first blocks) (second blocks))
          finally (return i)))
#+END_SRC

#+RESULTS:
: 16
*** Detect that the function is using ECB
#+BEGIN_SRC lisp
  (cp:with-oracle (oracle)
    (cp:detect-aes-128-ecb
     (oracle (make-array (* 16 2) :initial-element 97))))
#+END_SRC

#+RESULTS:
: 1
*** Use oracle to break ECB
#+BEGIN_SRC lisp
  (let ((unknown (cp:base64->bytes "Um9sbGluJyBpbiBteSA1L
  jAKV2l0aCBteSByYWctdG9wIGRvd24gc28gbXkgaGFpciBjYW4gYmxvd
  wpUaGUgZ2lybGllcyBvbiBzdGFuZGJ5IHdhdmluZyBqdXN0IHRvIHNhe
  SBoaQpEaWQgeW91IHN0b3A/IE5vLCBJIGp1c3QgZHJvdmUgYnkK")))
    (cp:with-oracle (oracle unknown)
      (cp:bytes->ascii (cp:break-aes-ecb-with-oracle #'oracle))))
#+END_SRC

#+RESULTS:
: "Rollin' in my 5.0
: With my rag-top down so my hair can blow
: The girlies on standby waving just to say hi
: Did you stop? No, I just drove by
: "
** ECB cut-and-paste
*** Write a k=v parsing routine
#+BEGIN_SRC lisp
  (cp:parse-cookie "foo=bar&baz=qux&zap=zazzle")
#+END_SRC

#+RESULTS:
: (("foo" . "bar") ("baz" . "qux") ("zap" . "zazzle"))

*** Write a function that encodes a user profile
#+BEGIN_SRC lisp
  (let ((user-profiler (cp:make-profiler "user")))
    (list (cp:profile-for user-profiler "alice")
          (cp:profile-for user-profiler "bob")
          (cp:profile-for user-profiler "eve")))
#+END_SRC

#+RESULTS:
: ("email=alice&uid=0&role=user" "email=bob&uid=1&role=user"
:  "email=eve&uid=2&role=user")

*** Carry out a cut-paste attack
~MAKE-ENCRYPTED-USER-PROFILER~ is just an AES ECB wrapper around
~MAKE-PROFILER~. Use carefully crafted email addresses to get blocks
that can be combined to create an admin profile.
#+BEGIN_SRC lisp
  (let* ((secret (cp:gen-random 16))
         (profiler (cp:make-encrypted-user-profiler secret 10))
         ;; Bogus email address so that the second block starts
         ;; with "admin": "admin&uid=10&rol"
         (admin (funcall profiler "aaaaaaaaaaadmin"))
         ;; Use a valid thirteen character email address so that
         ;; the second block ends with "role="
         (profile (funcall profiler "attak@jdtw.us"))
         ;; We need a third block to cut-paste from to get the
         ;; right pkcs7 padding
         (padding (funcall profiler "aaaaaaaaa")))
    ;; Now mix and match...
    (setf (nth-block 2 profile) (nth-block 1 admin)
          profile (concat-bytes profile (nth-block 2 padding)))
    (cp:decrypt-and-parse-profile secret profile))
#+END_SRC

#+RESULTS:
: (("email" . "attak@jdtw.us") ("uid" . "11") ("role" . "admin") ("uid" . "10")
:  ("rol" . ""))

Verify that our parser thinks the profile is an admin.
#+BEGIN_SRC lisp
  (cp:profile-role '(("email" . "attak@jdtw.us")
                     ("uid" . "11")
                     ("role" . "admin")
                     ("uid" . "10")
                     ("rol" . "")))
#+END_SRC

#+RESULTS:
: "admin"
