docs/challenges.html
<div id="outline-container-org1bac13e" class="outline-3">
<h3 id="org1bac13e"><span class="section-number-3">2.4</span> Byte-at-a-time ECB decryption (Simple)</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org09e8149" class="outline-4">
<h4 id="org09e8149"><span class="section-number-4">2.4.1</span> Detect the block size</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">cp:with-oracle</span> <span style="color: #6c3163;">(</span>oracle<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">loop</span> for i from <span style="color: #4e3163;">1</span> to <span style="color: #4e3163;">64</span>
        for encrypted = <span style="color: #2d9574;">(</span>oracle <span style="color: #67b11d;">(</span>make-array <span style="color: #b1951d;">(</span>* i <span style="color: #4e3163;">2</span><span style="color: #b1951d;">)</span> <span style="color: #3a81c3;">:initial-element</span> <span style="color: #4e3163;">97</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
        for blocks = <span style="color: #2d9574;">(</span>cp:blockify encrypted <span style="color: #3a81c3;">:block-size</span> i<span style="color: #2d9574;">)</span>
        until <span style="color: #2d9574;">(</span>equalp <span style="color: #67b11d;">(</span>first blocks<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>second blocks<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
        finally <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">return</span> i<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
16

</pre>
</div>
</div>
<div id="outline-container-org0691999" class="outline-4">
<h4 id="org0691999"><span class="section-number-4">2.4.2</span> Detect that the function is using ECB</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">cp:with-oracle</span> <span style="color: #6c3163;">(</span>oracle<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:detect-aes-128-ecb
   <span style="color: #2d9574;">(</span>oracle <span style="color: #67b11d;">(</span>make-array <span style="color: #b1951d;">(</span>* <span style="color: #4e3163;">16</span> <span style="color: #4e3163;">2</span><span style="color: #b1951d;">)</span> <span style="color: #3a81c3;">:initial-element</span> <span style="color: #4e3163;">97</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
1

</pre>
</div>
</div>
<div id="outline-container-orgfb5e8fa" class="outline-4">
<h4 id="orgfb5e8fa"><span class="section-number-4">2.4.3</span> Use oracle to break ECB</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>unknown <span style="color: #67b11d;">(</span>cp:base64-&gt;bytes <span style="color: #2d9574;">"Um9sbGluJyBpbiBteSA1L</span>
<span style="color: #2d9574;">jAKV2l0aCBteSByYWctdG9wIGRvd24gc28gbXkgaGFpciBjYW4gYmxvd</span>
<span style="color: #2d9574;">wpUaGUgZ2lybGllcyBvbiBzdGFuZGJ5IHdhdmluZyBqdXN0IHRvIHNhe</span>
<span style="color: #2d9574;">SBoaQpEaWQgeW91IHN0b3A/IE5vLCBJIGp1c3QgZHJvdmUgYnkK"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">cp:with-oracle</span> <span style="color: #2d9574;">(</span>oracle unknown<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>cp:bytes-&gt;ascii <span style="color: #67b11d;">(</span>cp:break-aes-ecb-with-oracle #'oracle<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"Rollin' in my 5.0
With my rag-top down so my hair can blow
The girlies on standby waving just to say hi
Did you stop? No, I just drove by
"

</pre>
</div>
</div>
</div>
<div id="outline-container-org172a72c" class="outline-3">
<h3 id="org172a72c"><span class="section-number-3">2.5</span> ECB cut-and-paste</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orgdf41f19" class="outline-4">
<h4 id="orgdf41f19"><span class="section-number-4">2.5.1</span> Write a k=v parsing routine</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:parse-cookie <span style="color: #2d9574;">"foo=bar&amp;baz=qux&amp;zap=zazzle"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
(("foo" . "bar") ("baz" . "qux") ("zap" . "zazzle"))

</pre>
</div>
</div>

<div id="outline-container-orgbdcaa7d" class="outline-4">
<h4 id="orgbdcaa7d"><span class="section-number-4">2.5.2</span> Write a function that encodes a user profile</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>user-profiler <span style="color: #67b11d;">(</span>cp:make-profiler <span style="color: #2d9574;">"user"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>list <span style="color: #2d9574;">(</span>cp:profile-for user-profiler <span style="color: #2d9574;">"alice"</span><span style="color: #2d9574;">)</span>
        <span style="color: #2d9574;">(</span>cp:profile-for user-profiler <span style="color: #2d9574;">"bob"</span><span style="color: #2d9574;">)</span>
        <span style="color: #2d9574;">(</span>cp:profile-for user-profiler <span style="color: #2d9574;">"eve"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
("email=alice&amp;uid=0&amp;role=user" "email=bob&amp;uid=1&amp;role=user"
 "email=eve&amp;uid=2&amp;role=user")

</pre>
</div>
</div>

<div id="outline-container-org1e2aab1" class="outline-4">
<h4 id="org1e2aab1"><span class="section-number-4">2.5.3</span> Carry out a cut-paste attack</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
<code>MAKE-ENCRYPTED-USER-PROFILER</code> is just an AES ECB wrapper around
<code>MAKE-PROFILER</code>. Use carefully crafted email addresses to get blocks
that can be combined to create an admin profile.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let*</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>secret <span style="color: #67b11d;">(</span>cp:gen-random <span style="color: #4e3163;">16</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>profiler <span style="color: #67b11d;">(</span>cp:make-encrypted-user-profiler secret <span style="color: #4e3163;">10</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Bogus email address so that the second block starts</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">with "admin": "admin&amp;uid=10&amp;rol"</span>
       <span style="color: #2d9574;">(</span>admin <span style="color: #67b11d;">(</span>funcall profiler <span style="color: #2d9574;">"aaaaaaaaaaadmin"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Use a valid thirteen character email address so that</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">the second block ends with "role="</span>
       <span style="color: #2d9574;">(</span>profile <span style="color: #67b11d;">(</span>funcall profiler <span style="color: #2d9574;">"attak@jdtw.us"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">We need a third block to cut-paste from to get the</span>
       <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">right pkcs7 padding</span>
       <span style="color: #2d9574;">(</span>padding <span style="color: #67b11d;">(</span>funcall profiler <span style="color: #2d9574;">"aaaaaaaaa"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Now mix and match...</span>
  <span style="color: #6c3163;">(</span>setf <span style="color: #2d9574;">(</span>nth-block <span style="color: #4e3163;">2</span> profile<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>nth-block <span style="color: #4e3163;">1</span> admin<span style="color: #2d9574;">)</span>
        profile <span style="color: #2d9574;">(</span>concat-bytes profile <span style="color: #67b11d;">(</span>nth-block <span style="color: #4e3163;">2</span> padding<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:decrypt-and-parse-profile secret profile<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
(("email" . "attak@jdtw.us") ("uid" . "11") ("role" . "admin") ("uid" . "10")
 ("rol" . ""))

</pre>

<p>
Verify that our parser thinks the profile is an admin.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:profile-role '<span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"email"</span> . <span style="color: #2d9574;">"attak@jdtw.us"</span><span style="color: #2d9574;">)</span>
                   <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"uid"</span> . <span style="color: #2d9574;">"11"</span><span style="color: #2d9574;">)</span>
                   <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"role"</span> . <span style="color: #2d9574;">"admin"</span><span style="color: #2d9574;">)</span>
                   <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"uid"</span> . <span style="color: #2d9574;">"10"</span><span style="color: #2d9574;">)</span>
                   <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"rol"</span> . <span style="color: #2d9574;">""</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"admin"

</pre>
</div>
</div>
</div>
