challenges.org
** Byte-at-a-time ECB decryption (Harder)
I modified my original oracle code and added "prefix" versions. The first task
is to find the length of the random prefix, which is what ~FIND-PREFIX-LENGTH~
does.
#+BEGIN_SRC lisp
  (loop for i below 256 do
    (cp:with-oracle (oracle nil (gen-random i))
      (let ((len (cp:find-prefix-length #'oracle)))
        (assert (= i len)))))
#+END_SRC

#+RESULTS:
: NIL

And once the prefix-length is known, it's just a matter of updating offsets
appropriately. Here we are decrypting the text, using a prefix of a random
length:
#+BEGIN_SRC lisp
  (let ((unknown (cp:base64->bytes "Um9sbGluJyBpbiBteSA1L
  jAKV2l0aCBteSByYWctdG9wIGRvd24gc28gbXkgaGFpciBjYW4gYmxvd
  wpUaGUgZ2lybGllcyBvbiBzdGFuZGJ5IHdhdmluZyBqdXN0IHRvIHNhe
  SBoaQpEaWQgeW91IHN0b3A/IE5vLCBJIGp1c3QgZHJvdmUgYnkK"))
        (prefix (cp:gen-random (random 255))))
    (cp:with-oracle (oracle unknown prefix)
      (cp:bytes->ascii (cp:break-aes-ecb-with-prefix-oracle #'oracle))))
#+END_SRC

#+RESULTS:
: "Rollin' in my 5.0
: With my rag-top down so my hair can blow
: The girlies on standby waving just to say hi
: Did you stop? No, I just drove by
: "
** PKCS#7 padding validation
#+BEGIN_SRC lisp
  (cp:bytes->ascii
   (cp:unpad-pkcs7
    (concatenate '(vector (unsigned-byte 8) *)
                 (cp:ascii->bytes "ICE ICE BABY")
                 #(4 4 4 4))))
#+END_SRC

#+RESULTS:
: "ICE ICE BABY"
#+BEGIN_SRC lisp
  (handler-case
      (cp:unpad-pkcs7
       (concatenate '(vector (unsigned-byte 8) *)
                    (cp:ascii->bytes "ICE ICE BABY")
                    #(5 5 5 5)))
    (cp:invalid-padding-error () :invalid-padding))
#+END_SRC

#+RESULTS:
: :INVALID-PADDING
#+BEGIN_SRC lisp
  (handler-case
      (cp:unpad-pkcs7
       (concatenate '(vector (unsigned-byte 8) *)
                    (cp:ascii->bytes "ICE ICE BABY")
                    #(1 2 3 4)))
    (cp:invalid-padding-error () :invalid-padding))
#+END_SRC

#+RESULTS:
: :INVALID-PADDING
** CBC bitflipping attacks
The intuition here is that the prior ciphertext block gets XOR'd with the output
of the AES s-box. That means, to get the required character, we need to XOR the
right ciphertext byte with the known-plaintext byte and the desired byte. That
is what the function ~CBC-FLIP~ does in the code below.
#+BEGIN_SRC lisp
  (let* ((secret (cp:gen-random 16))
         (iv (cp:gen-random 16))
         (user-data "aaaaaaaaaaaaaaaaaaaaaaadminatrue")
         (encrypted (cp:encrypt-user-data secret iv user-data)))
    ;; Flip the 'a' before "admin" to ';' and the 'a' before
    ;; "true" to '='. Hard code the indices, because I'm lazy.
    (cp:cbc-flip encrypted 37 #\a #\;)
    (cp:cbc-flip encrypted 43 #\a #\=)
    (cp:data-lookup "admin" (cp:decrypt-and-parse-data secret iv encrypted)))
#+END_SRC

#+RESULTS:
: "true"
* Set 3
