docs/challenges.html
<div id="outline-container-orgfc75e3c" class="outline-3">
<h3 id="orgfc75e3c"><span class="section-number-3">2.6</span> Byte-at-a-time ECB decryption (Harder)</h3>
<div class="outline-text-3" id="text-2-6">
<p>
I modified my original oracle code and added "prefix" versions. The first task
is to find the length of the random prefix, which is what <code>FIND-PREFIX-LENGTH</code>
does.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">loop</span> for i below <span style="color: #4e3163;">256</span> do
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">cp:with-oracle</span> <span style="color: #2d9574;">(</span>oracle nil <span style="color: #67b11d;">(</span>gen-random i<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>len <span style="color: #3a81c3;">(</span>cp:find-prefix-length #'oracle<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #dc752f; background-color: #fbf8ef;">assert</span> <span style="color: #b1951d;">(</span>= i len<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
NIL

</pre>

<p>
And once the prefix-length is known, it's just a matter of updating offsets
appropriately. Here we are decrypting the text, using a prefix of a random
length:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>unknown <span style="color: #67b11d;">(</span>cp:base64-&gt;bytes <span style="color: #2d9574;">"Um9sbGluJyBpbiBteSA1L</span>
<span style="color: #2d9574;">jAKV2l0aCBteSByYWctdG9wIGRvd24gc28gbXkgaGFpciBjYW4gYmxvd</span>
<span style="color: #2d9574;">wpUaGUgZ2lybGllcyBvbiBzdGFuZGJ5IHdhdmluZyBqdXN0IHRvIHNhe</span>
<span style="color: #2d9574;">SBoaQpEaWQgeW91IHN0b3A/IE5vLCBJIGp1c3QgZHJvdmUgYnkK"</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">(</span>prefix <span style="color: #67b11d;">(</span>cp:gen-random <span style="color: #b1951d;">(</span>random <span style="color: #4e3163;">255</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">cp:with-oracle</span> <span style="color: #2d9574;">(</span>oracle unknown prefix<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>cp:bytes-&gt;ascii <span style="color: #67b11d;">(</span>cp:break-aes-ecb-with-prefix-oracle #'oracle<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"Rollin' in my 5.0
With my rag-top down so my hair can blow
The girlies on standby waving just to say hi
Did you stop? No, I just drove by
"

</pre>
</div>
</div>
<div id="outline-container-orgc8381b7" class="outline-3">
<h3 id="orgc8381b7"><span class="section-number-3">2.7</span> PKCS#7 padding validation</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>cp:bytes-&gt;ascii
 <span style="color: #6c3163;">(</span>cp:unpad-pkcs7
  <span style="color: #2d9574;">(</span>concatenate '<span style="color: #67b11d;">(</span>vector <span style="color: #b1951d;">(</span>unsigned-byte <span style="color: #4e3163;">8</span><span style="color: #b1951d;">)</span> *<span style="color: #67b11d;">)</span>
               <span style="color: #67b11d;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"ICE ICE BABY"</span><span style="color: #67b11d;">)</span>
               #<span style="color: #67b11d;">(</span><span style="color: #4e3163;">4</span> <span style="color: #4e3163;">4</span> <span style="color: #4e3163;">4</span> <span style="color: #4e3163;">4</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"ICE ICE BABY"

</pre>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">handler-case</span>
    <span style="color: #6c3163;">(</span>cp:unpad-pkcs7
     <span style="color: #2d9574;">(</span>concatenate '<span style="color: #67b11d;">(</span>vector <span style="color: #b1951d;">(</span>unsigned-byte <span style="color: #4e3163;">8</span><span style="color: #b1951d;">)</span> *<span style="color: #67b11d;">)</span>
                  <span style="color: #67b11d;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"ICE ICE BABY"</span><span style="color: #67b11d;">)</span>
                  #<span style="color: #67b11d;">(</span><span style="color: #4e3163;">5</span> <span style="color: #4e3163;">5</span> <span style="color: #4e3163;">5</span> <span style="color: #4e3163;">5</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:invalid-padding-error <span style="color: #2d9574;">()</span> <span style="color: #3a81c3;">:invalid-padding</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
:INVALID-PADDING

</pre>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">handler-case</span>
    <span style="color: #6c3163;">(</span>cp:unpad-pkcs7
     <span style="color: #2d9574;">(</span>concatenate '<span style="color: #67b11d;">(</span>vector <span style="color: #b1951d;">(</span>unsigned-byte <span style="color: #4e3163;">8</span><span style="color: #b1951d;">)</span> *<span style="color: #67b11d;">)</span>
                  <span style="color: #67b11d;">(</span>cp:ascii-&gt;bytes <span style="color: #2d9574;">"ICE ICE BABY"</span><span style="color: #67b11d;">)</span>
                  #<span style="color: #67b11d;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span> <span style="color: #4e3163;">4</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:invalid-padding-error <span style="color: #2d9574;">()</span> <span style="color: #3a81c3;">:invalid-padding</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
:INVALID-PADDING

</pre>
</div>
</div>
<div id="outline-container-org1abe578" class="outline-3">
<h3 id="org1abe578"><span class="section-number-3">2.8</span> CBC bitflipping attacks</h3>
<div class="outline-text-3" id="text-2-8">
<p>
The intuition here is that the prior ciphertext block gets XOR'd with the output
of the AES s-box. That means, to get the required character, we need to XOR the
right ciphertext byte with the known-plaintext byte and the desired byte. That
is what the function <code>CBC-FLIP</code> does in the code below.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let*</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span>secret <span style="color: #67b11d;">(</span>cp:gen-random <span style="color: #4e3163;">16</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>iv <span style="color: #67b11d;">(</span>cp:gen-random <span style="color: #4e3163;">16</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>user-data <span style="color: #2d9574;">"aaaaaaaaaaaaaaaaaaaaaaadminatrue"</span><span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>encrypted <span style="color: #67b11d;">(</span>cp:encrypt-user-data secret iv user-data<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Flip the 'a' before "admin" to ';' and the 'a' before</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"true" to '='. Hard code the indices, because I'm lazy.</span>
  <span style="color: #6c3163;">(</span>cp:cbc-flip encrypted <span style="color: #4e3163;">37</span> #\a #\;<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:cbc-flip encrypted <span style="color: #4e3163;">43</span> #\a #\=<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>cp:data-lookup <span style="color: #2d9574;">"admin"</span> <span style="color: #2d9574;">(</span>cp:decrypt-and-parse-data secret iv encrypted<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<pre class="example">
"true"

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-10-08 Sun 21:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
